/*
Я не очень понял в чем заключается наследование Bike от Bicycle, возможно из-за того, что я не в теме,
во втором примере это вроде классика про млекопитающих, но композиция голова немного удивила,
наверно, потому что возникает вопрос, а есть ли млекопитающие без головы, не должна ли она быть в
родительском классе тогда? С остальным согласен. Я сам пытался из игр придумать пример, подумав чуть
дольше понял, что ячейки поля это не так плохо, но вот огнестрельное оружие еще лучше было бы примером.
*/