/*
С абстрагированием как-то попроще, взять те же умные девайсы, можно представить, что кто-то завел сначала умную лампочку, а потом туда приехали rgb-лампочки, светодиодные 
ленты, какие-нибудь умные розетки и это все объединилось умным девайсом, так как у всего есть Включить/Выключить.
С факторизацией можно попробовать что-то из игр придумать, когда были игроки/объекты/монстры и для того, чтобы корректно взрывы заработали пришлось всех объединить
под эгидой способности получить урон, чтобы не бегать по разным циклам для каждого типа существ отдельно, прописывая, что с ними случилось.
*/
