/*
Рефлексия до сдачи:
Пришлось перечитать пару раз, как-то тяжело ложились слова ковариантный, контрвариантый, и погуглить как это поддерживает
C#, оказалось, что можно реализовать примеры из материала полностью, потому что в современном стандарте поддерживают ковариантность
возвращаемого типа, а для контейнеров просто нужно знать про ключевое слово out.

Рефлексия постфактум:
В первом примере сначала тоже взяли за основу материал занятия, а вот контрвариантность на питоне я сходу как-то даже и не понял, слишком
мало на этом языке писал, про оружие пример тоже понравился как фанату игр.
*/