/*
Первый пример это сотрудник и его должность, легко сказать, что кто-то является разработчиком/лидом/менеджером, но в реальности
сотрудники могут менять должности/списки обязанностей,а то и совмещать, поэтому корректнее будет использовать композицию,
причем вероятно даже не просто поле работы завести, а списка работ.
Второй пример это окна в GUI и их оформления, легко не подумав завести темное/светлое окно, и какие-то подобные вещи, а потом
придется пересоздавать окна, и на самом деле вызывает вопросы, когда переключение темы на сайте требует его полной перезагрузки.
*/